blueprint/app/controllers/awarenesses_controller.rb

SELECT "awarenesses".* FROM "awarenesses" ORDER BY id DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @awarenesses = Awareness.all
    @our_input = Awareness.order("id DESC").first

INSERT INTO "awarenesses" ("title", "subject", "subtopics", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "John Which"], ["subject", " MOVIE"], ["subtopics", "How its a staple for hollywood"], ["created_at", "2023-03-24 17:17:28.458663"], ["updated_at", "2023-03-24 17:17:28.458663"]]
---
  def create
    @awareness = Awareness.new(awareness_params)

    respond_to do |format|
      if @awareness.save

SELECT "awarenesses".* FROM "awarenesses" WHERE "awarenesses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_awareness
      @awareness = Awareness.find(params[:id])