blueprint/app/controllers/presentations_controller.rb

  def index
    @presentations = Presentation.all
---
SELECT "presentations".* FROM "presentations"

  def create
    @presentation = Presentation.new(presentation_params)

    respond_to do |format|
      if @presentation.save
---
INSERT INTO "presentations" ("title", "subject", "subtopics", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

    def set_presentation
      @presentation = Presentation.find(params[:id])
---
SELECT "presentations".* FROM "presentations" WHERE "presentations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]