blueprint/app/controllers/professionals_controller.rb

SELECT "professionals".* FROM "professionals" ORDER BY id DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @professionals = Professional.all
    @our_input = Professional.order("id DESC").first

INSERT INTO "professionals" ("company", "slogan", "about", "looking", "benefits", "address", "phone", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @professional = Professional.new(professional_params)

    respond_to do |format|
      if @professional.save

UPDATE "professionals" SET "benefits" = ?, "address" = ?, "phone" = ?, "email" = ?, "updated_at" = ? WHERE "professionals"."id" = ?  [["benefits", "ttttttttttttttttttt"], ["address", "123 st"], ["phone", "7202222222"], ["email", "thisai@chat.com"], ["updated_at", "2023-04-05 01:47:50.726142"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @professional.update(professional_params)

DELETE FROM "professionals" WHERE "professionals"."id" = ?  [["id", 2]]
---
  def destroy
    @professional.destroy

SELECT "professionals".* FROM "professionals" WHERE "professionals"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_professional
      @professional = Professional.find(params[:id])