blueprint/app/controllers/userinputs_controller.rb

SELECT "userinputs".* FROM "userinputs" ORDER BY id DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @userinputs = Userinput.all
    @our_input = Userinput.order("id DESC").first

INSERT INTO "userinputs" ("title", "subject", "subtopics", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "john"], ["subject", "whick"], ["subtopics", "33333"], ["created_at", "2023-02-14 00:11:34.175584"], ["updated_at", "2023-02-14 00:11:34.175584"]]
---
  def create
    @userinput = Userinput.new(userinput_params)

    respond_to do |format|
      if @userinput.save

UPDATE "userinputs" SET "subtopics" = ?, "updated_at" = ? WHERE "userinputs"."id" = ?  [["subtopics", "the movie"], ["updated_at", "2023-02-16 22:45:31.024110"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @userinput.update(userinput_params)

DELETE FROM "userinputs" WHERE "userinputs"."id" = ?  [["id", 2]]
---
  def destroy
    @userinput.destroy

SELECT "userinputs".* FROM "userinputs" WHERE "userinputs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_userinput
      @userinput = Userinput.find(params[:id])